# Postgres + Pandas

In [2]:
import pandas as pd
from sqlalchemy import create_engine
import os

### Store CSV into DataFrame

In [3]:
csv_file = os.path.join("Resources", "revenue.csv")
revenue_df = pd.read_csv(csv_file)
revenue_df.head

<bound method NDFrame.head of           country  revenue  gamers
0           China    36500     640
1           India     1560     300
2   Latin America     2450     253
3  Southeast Asia     4300     227
4              US    35500     164
5              UK     4700      37>

In [4]:
#Creating a copy of the df to choose only required columns

df=revenue_df[['country','revenue','gamers']]

In [5]:
df.head()

          country  revenue  gamers
0           China    36500     640
1           India     1560     300
2   Latin America     2450     253
3  Southeast Asia     4300     227
4              US    35500     164

In [6]:
df.dtypes

country    object
revenue     int64
gamers      int64
dtype: object

### Summarizing streaming channels into a single column

In [7]:
csv_file = os.path.join("Resources", "age.csv")
age_df = pd.read_csv(csv_file)
age_df.head

<bound method NDFrame.head of        age  avg_hours
0    18-25       7.78
1    26-35       8.21
2    36-45       7.76
3    46-60       6.32
4  Over 60       5.63>

In [8]:
#Creating a copy of the df to choose only required columns

df=age_df[['age','avg_hours']]

In [9]:
df.dtypes

age           object
avg_hours    float64
dtype: object

In [10]:
csv_file = os.path.join("Resources", "gender.csv")
gender_df = pd.read_csv(csv_file)
gender_df.head

<bound method NDFrame.head of        country  perc_male  perc_female
0           US       0.54         0.46
1        Japan       0.34         0.66
2           UK       0.51         0.49
3  South Korea       0.63         0.37
4        China       0.73         0.27>

In [11]:
#Creating a copy of the df to choose only required columns

df=gender_df[['country','perc_male', 'perc_female']]
df.head()
df.dtypes

country         object
perc_male      float64
perc_female    float64
dtype: object

In [12]:
csv_file = os.path.join("Resources", "hours_average_country.csv")
hours_average_country_df = pd.read_csv(csv_file)
hours_average_country_df.head
hours_average_country_df.dtypes

country       object
avg_hours    float64
dtype: object

In [13]:
#Creating a copy of the df to choose only required columns

df=hours_average_country_df[['country','avg_hours']]
df.head()
df.dtypes

country       object
avg_hours    float64
dtype: object

In [14]:
csv_file = os.path.join("Resources", "steam_users_lifetime.csv")
steam_users_lifetime_df = pd.read_csv(csv_file)
steam_users_lifetime_df.head
df.dtypes

country       object
avg_hours    float64
dtype: object

In [15]:
#Creating a copy of the df to choose only required columns

df=steam_users_lifetime_df[['date','users', 'in_game']]
df.head()

       date     users  in_game
0  1/1/2019  16067952  4915125
1  1/2/2019  16124928  4838979
2  1/3/2019  15938390  4737719
3  1/4/2019  16473114  5088225
4  1/5/2019  17469182  5555946

In [16]:
csv_file = os.path.join("Resources", "top_ten.csv")
top_ten_df = pd.read_csv(csv_file)
top_ten_df.head

<bound method NDFrame.head of            date  dota_2  counter_strike  terraria  postal     gta  fallout_4  \
0      1/1/2019  630381          577546     30825       9  105875      25257
1      1/2/2019  653543          617293     29696      10  104300      21224
2      1/3/2019  645297          614938     29331       9  102460      20530
3      1/4/2019  679515          648525     32569       7  111765      20679
4      1/5/2019  731384          671521     38075      11  118732      23563
..          ...     ...             ...       ...     ...     ...        ...
696  11/27/2020  594916          957979     40937      17  141985      21315
697  11/28/2020  635421         1032509     45245      14  157463      23544
698  11/29/2020  638909          998892     42417      16  153361      24759
699  11/30/2020  579531          911943     36268      16  131554      19985
700   12/1/2020  585832          901058     36071      15  129733      19625

     life_is_strange  battlegrounds  hitman_2  among_us
0                272         986759      7354        18
1                230         988726      5703        16
2                215         978611      5949        23
3                215        1037423      5923        19
4                172        1091897      9705        21
..               ...            ...       ...       ...
696              536         417104      3251    221984
697              716         440877      4511    222159
698              709         438119      5025    174028
699              539         406080      3884    151449
700              578         400859      3754    140283

[701 rows x 11 columns]>

In [17]:
#Creating a copy of the df to choose only required columns

df=top_ten_df[['date','dota_2', 'counter_strike', 'terraria', 'postal', 'gta', 'fallout_4', 'life_is_strange', 'battlegrounds', 'hitman_2', 'among_us']]
df.head()

,date,dota_2,counter_strike,terraria,postal,gta,fallout_4,life_is_strange,battlegrounds,hitman_2,among_us
0,1/1/2019,630381,577546,30825,9,105875,25257,272,986759,7354,18
1,1/2/2019,653543,617293,29696,10,104300,21224,230,988726,5703,16
2,1/3/2019,645297,614938,29331,9,102460,20530,215,978611,5949,23
3,1/4/2019,679515,648525,32569,7,111765,20679,215,1037423,5923,19
4,1/5/2019,731384,671521,38075,11,118732,23563,172,1091897,9705,21

In [34]:
excel_file = os.path.join("Resources", "hours_perc_age.xlsx")
hours_per_week_by_age_group_df = pd.read_excel(excel_file)
hours_per_week_by_age_group_df.head

<bound method NDFrame.head of        Age  <_1_hour  1-2_hours  2-4_hours  4-7_hours  7-12_hours  \
0    18-25     0.094      0.157      0.192      0.202       0.126
1    26-35     0.101      0.134      0.182      0.176       0.170
2    36-45     0.120      0.153      0.167      0.179       0.161
3    46-60     0.194      0.182      0.152      0.171       0.138
4  Over 60     0.215      0.237      0.155      0.142       0.111
5      All     0.149      0.171      0.168      0.173       0.144

   12-20_hours  20+_hours  avg_hours
0        0.124      0.105       7.78
1        0.123      0.115       8.21
2        0.114      0.106       7.76
3        0.090      0.072       6.32
4        0.072      0.068       5.63
5        0.104      0.092       7.11  >

In [35]:
#Creating a copy of the df to choose only required columns

df=hours_per_week_by_age_group_df[["Age", "<_1_hour", "1-2_hours", "2-4_hours", "4-7_hours", "7-12_hours", "12-20_hours", "20+_hours", "avg_hours"]]
df.head()

,Age,<_1_hour,1-2_hours,2-4_hours,4-7_hours,7-12_hours,12-20_hours,20+_hours,avg_hours
0,18-25,0.094,0.157,0.192,0.202,0.126,0.124,0.105,7.78
1,26-35,0.101,0.134,0.182,0.176,0.170,0.123,0.115,8.21
2,36-45,0.120,0.153,0.167,0.179,0.161,0.114,0.106,7.76
3,46-60,0.194,0.182,0.152,0.171,0.138,0.090,0.072,6.32
4,Over 60,0.215,0.237,0.155,0.142,0.111,0.072,0.068,5.63

### Connect to local database

In [18]:
pg_user = 'postgres'
db_name = 'Gamers'

connection_string = f"{pg_user}:bootcampDavid@1942@localhost:5432/{db_name}"
engine = create_engine(f'postgresql://{connection_string}')

### Check for tables

In [19]:
engine.table_names()

['revenue',
 'hours_average_country',
 'gender',
 'top_ten',
 'steam_users_lifetime',
 'age']

### Use pandas to load json converted DataFrame into database

In [20]:
# load revenue table data to postgresDB
revenue_df.to_sql(name='revenue', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the customer_name table
* NOTE: can also check using pgAdmin

In [21]:
pd.read_sql_query('select * from revenue', con=engine).head()

          country  revenue  gamers
0           China    36500     640
1           India     1560     300
2   Latin America     2450     253
3  Southeast Asia     4300     227
4              US    35500     164

In [22]:
# Load age table data to postgresDB
age_df.to_sql(name='age', con=engine, if_exists='append', index=False)
pd.read_sql_query('select * from age', con=engine).head()

       age  avg_hours
0    18-25          8
1    26-35          8
2    36-45          8
3    46-60          6
4  Over 60          6

In [23]:
# Load gender table data to postgresDB
gender_df.to_sql(name='gender', con=engine, if_exists='append', index=False)
pd.read_sql_query('select * from gender', con=engine).head()

       country  perc_male  perc_female
0           US       0.54         0.46
1        Japan       0.34         0.66
2           UK       0.51         0.49
3  South Korea       0.63         0.37
4        China       0.73         0.27

In [24]:
# Load hours_average_country table data to postgresDB
hours_average_country_df.to_sql(name='hours_average_country', con=engine, if_exists='append', index=False)
pd.read_sql_query('select * from hours_average_country', con=engine).head()

     country  avg_hours
0    Germany       7.98
1         US       7.61
2  Singapore       7.44
3      India       6.97
4      India       6.92

In [25]:
# Load revenue table data to postgresDB
revenue_df.to_sql(name='revenue', con=engine, if_exists='append', index=False)
pd.read_sql_query('select * from revenue', con=engine).head()

          country  revenue  gamers
0           China    36500     640
1           India     1560     300
2   Latin America     2450     253
3  Southeast Asia     4300     227
4              US    35500     164

In [26]:
# Load steam_users_lifetime table data to postgresDB
steam_users_lifetime_df.to_sql(name='steam_users_lifetime', con=engine, if_exists='append', index=False)
pd.read_sql_query('select * from steam_users_lifetime', con=engine).head()

         date     users  in_game
0  2019-01-01  16067952  4915125
1  2019-01-02  16124928  4838979
2  2019-01-03  15938390  4737719
3  2019-01-04  16473114  5088225
4  2019-01-05  17469182  5555946

In [27]:
# Load top_ten table data to postgresDB
top_ten_df.to_sql(name='top_ten', con=engine, if_exists='append', index=False)
pd.read_sql_query('select * from top_ten', con=engine).head()

,date,dota_2,counter_strike,terraria,postal,gta,fallout_4,life_is_strange,battlegrounds,hitman_2,among_us
0,2019-01-01,630381,577546,30825,9,105875,25257,272,986759,7354,18
1,2019-01-02,653543,617293,29696,10,104300,21224,230,988726,5703,16
2,2019-01-03,645297,614938,29331,9,102460,20530,215,978611,5949,23
3,2019-01-04,679515,648525,32569,7,111765,20679,215,1037423,5923,19
4,2019-01-05,731384,671521,38075,11,118732,23563,172,1091897,9705,21